{
  "Cat-Cow Stretch": "Start on your hands and knees. Inhale as you drop your belly towards the mat and look up (Cow). Exhale as you round your spine, tuck your chin to your chest, and press the mat away (Cat). Repeat the flow smoothly.",
  "Child's Pose": "From a kneeling position, sit back on your heels, then fold forward, resting your forehead on the floor. Your arms can be stretched out in front of you or resting alongside your body. Breathe deeply into your back.",
  "Gentle Spinal Twists": "Lie on your back with your knees bent and feet flat on the floor. Extend your arms to the sides. Gently let both knees fall to one side, keeping your shoulders on the floor. Hold the stretch, then return to center and repeat on the other side.",
  "Hip Circles": "Start on your hands and knees. Lift one knee and begin to make large, slow circles with it, moving from the hip joint. Complete reps in one direction, then reverse.",
  "Deep Diaphragmatic Breathing": "Lie or sit comfortably. Place one hand on your chest and the other on your belly. Inhale deeply through your nose, allowing your belly to rise. Exhale slowly through your mouth, feeling your belly fall. The hand on your chest should remain relatively still.",
  "Foam Roll Glutes": "Sit on a foam roller with one foot crossed over the opposite knee (figure-four position). Gently lean into the side of the crossed leg, rolling back and forth over your glute muscle. Pause on any tender spots.",
  "Foam Roll Quads": "Lie face down with the foam roller under the front of your thighs. Use your arms to roll your body up and down, from the bottom of your hip to the top of your knee.",
  "Pigeon Pose": "Start in a downward dog or tabletop position. Bring one knee forward and place it behind the wrist on the same side, with your shin angled across the mat. Extend the other leg straight back. Keep your hips square and fold forward if comfortable.",
  "World's Greatest Stretch": "Step forward into a lunge. Place the hand opposite your front foot on the floor. Your other elbow should be inside your front foot. Rotate your torso to open your chest toward the ceiling, reaching up with your arm. Return to the start and repeat.",
  "Standing Quad Stretch": "Stand on one leg, holding onto something for balance if needed. Grab your other foot and gently pull your heel towards your glute, feeling a stretch in the front of your thigh. Keep your knees together.",
  "Sun Salutation A": "A flowing sequence of poses, typically including Mountain Pose, Forward Fold, Halfway Lift, Plank, Chaturanga, Upward-Facing Dog, and Downward-Facing Dog. Each movement is synchronized with the breath.",
  "Downward Dog": "From a plank position, push your hips up and back, forming an inverted V-shape with your body. Press your hands firmly into the mat and keep your head between your upper arms.",
  "Warrior II": "Stand with feet wide apart. Turn one foot out 90 degrees and the other foot in slightly. Bend your front knee to 90 degrees, keeping it aligned with your ankle. Extend your arms parallel to the floor, gazing over your front hand.",
  "Triangle Pose": "From a wide stance, turn one foot out. Hinge at your hips over the straight front leg, bringing your hand down to your shin, ankle, or the floor. Extend the other arm towards the ceiling.",
  "Savasana": "Lie flat on your back with your legs and arms relaxed and spread comfortably. Close your eyes and allow your body to feel heavy, releasing all tension. Breathe naturally and rest.",
  "Jumping Jacks": "Stand with your feet together and your hands at your sides. Simultaneously jump your feet out to the sides while raising your arms above your head. Jump back to the starting position.",
  "High Knees": "Stand in place and run, driving your knees up towards your chest as high as possible. Use your arms to help with momentum.",
  "Butt Kicks": "Stand in place and jog, focusing on kicking your heels back towards your glutes. Keep your chest up.",
  "Arm Circles": "Stand with your arms extended out to your sides at shoulder height. Make small, controlled circles with your arms, gradually making them larger. Reverse direction after completing reps.",
  "Leg Swings": "Stand holding onto a support. Swing one leg forward and backward in a controlled motion, keeping your torso stable. Repeat for reps, then switch legs.",
  "Incline Walking": "Set a treadmill to an incline and walk at a steady, brisk pace. Keep your posture upright and avoid holding onto the handrails if possible.",
  "Bird-Dog": "Start on your hands and knees. Simultaneously extend your right arm forward and your left leg backward, keeping your back flat and core engaged. Return to the start and repeat on the other side.",
  "Dead Bug": "Lie on your back with your arms extended towards the ceiling and your knees bent at a 90-degree angle over your hips. Slowly lower your right arm and left leg toward the floor, keeping your lower back pressed into the mat. Return to the start and repeat on the other side.",
  "Pelvic Tilts": "Lie on your back with your knees bent and feet flat. Gently flatten your lower back against the floor by engaging your abdominal muscles and tilting your pelvis upward slightly. Hold, then release.",
  "Foam Roll Calves": "Sit on the floor with your legs straight out, and place the foam roller under your calves. Use your hands to support your weight and lift your hips, then roll from your ankles to below your knees.",
  "Foam Roll Hamstrings": "Sit with the foam roller under your thighs. Support your weight with your hands and roll from the back of your knees to the bottom of your glutes.",
  "Foam Roll IT Band": "Lie on your side with the foam roller under your bottom leg's hip. Use your top leg and arms for support. Roll along the outer thigh from your hip to your knee, avoiding the knee joint itself.",
  "Foam Roll Lats": "Lie on your side with your arm extended overhead and the foam roller placed in your armpit area. Gently roll up and down the side of your upper back.",
  "Foam Roll Thoracic Spine": "Lie on your back with the foam roller under your mid-back. Cross your arms over your chest and lift your hips. Use your feet to roll up and down between your shoulder blades and mid-back.",
  "Brisk Walking": "Walk at a pace that is faster than a stroll but allows you to maintain a conversation. Swing your arms and maintain good posture.",
  "Hamstring Stretch": "Sit on the floor with one leg extended straight and the other bent with the sole of your foot against your inner thigh. Gently hinge at your hips and lean forward over the straight leg until you feel a stretch.",
  "Quad Stretch": "Lie on your side. Grab the ankle of your top leg and gently pull your heel towards your glute. Keep your hips stacked and push your hip slightly forward to deepen the stretch.",
  "Glute Stretch (Figure-four)": "Lie on your back with knees bent. Cross one ankle over the opposite knee. Reach through and grab the back of the thigh of the supporting leg, gently pulling it towards your chest.",
  "Chest Stretch in Doorway": "Stand in a doorway and place your forearms on the frame, with your elbows slightly below shoulder height. Step forward with one foot until you feel a stretch across your chest.",
  "Triceps Stretch": "Reach one arm overhead, bend your elbow, and let your hand fall down your back. Use your other hand to gently pull the elbow, deepening the stretch in your tricep.",
  "Tai Chi Basic Stepping": "Stand with feet shoulder-width apart. Shift your weight to one leg, then slowly step forward with the other, placing the heel down first. Transfer weight smoothly and repeat.",
  "Box Breathing": "Inhale for a count of four, hold your breath for a count of four, exhale for a count of four, and hold the exhale for a count of four. This completes one cycle.",
  "Body Scan Meditation": "Lie down comfortably. Bring your awareness to your toes, noticing any sensations. Slowly move your focus up through your feet, legs, torso, arms, and head, paying gentle, non-judgmental attention to each body part.",
  "Neck Half-Circles": "Sit or stand tall. Gently drop your chin to your chest. Slowly roll your right ear towards your right shoulder, then roll back to center and over to the left side. Avoid rolling your head all the way back.",
  "Shoulder Rolls": "Sit or stand tall. Inhale and lift your shoulders up towards your ears. Exhale and roll them back and down. Repeat for reps, then reverse the direction.",
  "Seated Forward Bend": "Sit on the floor with your legs extended in front of you. Hinge at your hips and fold your torso over your legs, reaching for your shins, ankles, or feet. Keep your back relatively straight.",
  "Happy Baby Pose": "Lie on your back. Draw your knees towards your armpits and grab the outsides of your feet. Gently rock from side to side if it feels good. Keep your lower back on the floor.",
  "Legs Up The Wall": "Sit sideways next to a wall. Swing your legs up the wall as you lie back, so your glutes are as close to the wall as possible. Rest with your arms out to the sides.",
  "Bodyweight Squats": "Stand with feet shoulder-width apart, chest up, and core engaged. Lower your hips back and down as if sitting in a chair, keeping your weight in your heels. Go as low as you can comfortably, then press back up to the start.",
  "Incline Push-Ups": "Place your hands on an elevated surface like a bench or wall, slightly wider than your shoulders. Step your feet back into a plank position. Lower your chest to the surface, then push back up. The higher the surface, the easier the exercise.",
  "Dumbbell Rows": "Stand with feet shoulder-width apart, holding a dumbbell in each hand. Hinge at your hips so your torso is nearly parallel to the floor, back flat. Pull the dumbbells up towards your chest, squeezing your shoulder blades. Lower with control.",
  "Glute Bridges": "Lie on your back with knees bent, feet flat on the floor, and arms by your sides. Squeeze your glutes and lift your hips off the floor until your body forms a straight line from your shoulders to your knees. Hold, then lower.",
  "Plank": "Hold a push-up position, with your hands or forearms on the floor. Your body should form a straight line from head to heels. Engage your core and glutes, and don't let your hips sag.",
  "Goblet Squats": "Hold one dumbbell vertically against your chest with both hands. Stand with feet slightly wider than shoulder-width. Keeping your chest up, lower into a squat. Push through your heels to return to the start.",
  "Dumbbell Bench Press": "Lie on a flat bench, holding a dumbbell in each hand at your chest. Press the dumbbells straight up until your arms are fully extended. Lower them slowly and with control.",
  "Lat Pulldowns": "Sit at a lat pulldown machine and grab the bar with a wide, overhand grip. Keeping your chest up, pull the bar down to your upper chest, squeezing your back muscles. Slowly return the bar to the starting position.",
  "Dumbbell Lunges": "Stand holding a dumbbell in each hand. Step forward with one leg and lower your hips until both knees are bent at a 90-degree angle. Your front knee should be over your ankle, and your back knee should hover just above the ground. Push off the front foot to return to the start. Alternate legs.",
  "Seated Dumbbell Shoulder Press": "Sit on a bench with back support, holding a dumbbell in each hand at shoulder height, palms facing forward. Press the dumbbells overhead until your arms are fully extended. Lower with control.",
  "Hanging Knee Raises": "Hang from a pull-up bar. Keeping your legs together, use your lower abs to raise your knees towards your chest. Lower them slowly.",
  "Barbell Back Squats": "Position a barbell across your upper back and shoulders. Stand with feet shoulder-width apart. Keeping your chest up and back straight, squat down until your thighs are at least parallel to the floor. Drive through your heels to stand back up.",
  "Pull-Ups (Assisted or Bodyweight)": "Grip a pull-up bar with hands slightly wider than your shoulders, palms facing away. Hang with arms fully extended. Pull your body up until your chin is over the bar. Lower yourself with control. Use an assisted machine or a band for help if needed.",
  "Dumbbell Overhead Press": "Stand with feet shoulder-width apart, holding dumbbells at your shoulders. Press the weights directly overhead until your arms are fully extended. Lower with control.",
  "Romanian Deadlifts": "Hold a barbell or dumbbells in front of your thighs. With a slight bend in your knees, hinge at your hips, keeping your back straight. Lower the weight down your shins until you feel a deep stretch in your hamstrings. Squeeze your glutes to return to the start.",
  "Push-Ups": "Start in a high plank position, hands under shoulders. Lower your body until your chest is just above the floor, keeping your elbows tucked in. Press back up to the start. Perform on your knees to make it easier.",
  "Russian Twists": "Sit on the floor with your knees bent and feet slightly elevated. Lean back slightly, keeping your back straight. Twist your torso from side to side, touching the floor with your hands on each side.",
  "Kettlebell Swings": "Stand with feet shoulder-width apart, holding a kettlebell with both hands. Hinge at your hips, swinging the kettlebell between your legs. Drive your hips forward explosively to swing the kettlebell up to chest height. Let it swing back down and repeat.",
  "Dumbbell Thrusters": "Hold two dumbbells at your shoulders. Drop into a squat, and as you stand back up, use the momentum to press the dumbbells directly overhead. Lower the dumbbells back to your shoulders and repeat.",
  "Bent-Over Rows": "Hold a dumbbell in each hand and hinge at the hips, keeping your back flat. Pull the weights up towards your lower chest, squeezing your back muscles. Lower with control.",
  "Stationary Bike Sprints": "On a stationary bike, pedal as fast and hard as you can for the specified time, then slow down for the rest period.",
  "Mountain Climbers": "Start in a high plank position. Drive one knee towards your chest, then quickly switch to the other knee, as if running in place.",
  "Burpees": "From a standing position, drop into a squat, place your hands on the floor, and kick your feet back into a plank. Perform a push-up, then jump your feet back to your hands and explosively jump up with your arms overhead.",
  "Jump Squats": "Perform a bodyweight squat, but explode up into a jump at the top of the movement. Land softly and immediately go into the next squat.",
  "Push-Up to Renegade Row": "In a high plank position with a dumbbell in each hand. Perform a push-up. At the top, row one dumbbell up to your side, then the other. That's one rep.",
  "Plank Jacks": "Start in a plank position on your hands or forearms. Jump your feet wide apart and then back together, like a horizontal jumping jack. Keep your hips stable.",
  "Leg Press": "Sit in a leg press machine with your feet shoulder-width apart on the platform. Press the platform away until your legs are nearly straight (don't lock your knees). Slowly lower the weight back to the start.",
  "Seated Cable Row": "Sit at a cable row machine with your feet on the platform and knees slightly bent. Grab the handle and pull it towards your abdomen, squeezing your shoulder blades together. Slowly extend your arms to return to the start.",
  "Dumbbell Lateral Raises": "Stand holding a dumbbell in each hand at your sides. With a slight bend in your elbows, raise your arms out to the sides until they are at shoulder level. Lower with control.",
  "Crunches": "Lie on your back with knees bent and feet on the floor. Place your hands behind your head or across your chest. Lift your head and shoulders off the floor, engaging your abs. Lower with control.",
  "Resistance Band Pull-Aparts": "Stand holding a resistance band with both hands, arms straight out in front of you at shoulder height. Pull the band apart by squeezing your shoulder blades together. Return to the start with control.",
  "Wall Sit": "Stand with your back against a wall. Slide down until your knees are at a 90-degree angle, as if you're sitting in a chair. Hold the position.",
  "Dumbbell Bicep Curls": "Stand or sit holding a dumbbell in each hand, palms facing forward. Curl the weights up towards your shoulders, keeping your elbows pinned to your sides. Lower with control.",
  "Bodyweight Calf Raises": "Stand on a flat surface or with the balls of your feet on an elevated edge. Raise your heels up as high as possible, squeezing your calf muscles. Lower slowly.",
  "Kettlebell Goblet Squats": "Hold a kettlebell with both hands at chest level. Perform a squat, keeping your chest up and elbows inside your knees. Drive back up to the starting position.",
  "Battle Ropes": "Hold one end of a heavy rope in each hand. Create waves by alternating whipping your arms up and down. You can also slam both ropes down at the same time.",
  "Box Jumps": "Stand in front of a sturdy box or platform. Jump explosively onto the center of the box, landing softly with your knees bent. Step back down.",
  "Medicine Ball Slams": "Hold a medicine ball overhead with both hands. Slam it into the ground in front of you with as much force as you can. Catch the ball on the bounce and repeat.",
  "Rowing Machine Sprints": "On a rowing machine, pull as hard and fast as you can to cover the specified distance in the shortest time possible.",
  "Dumbbell Step-Ups": "Stand in front of a bench or platform, holding dumbbells. Step onto the bench with one foot, driving through the heel to lift your body up. Bring the other foot to meet it. Step back down and alternate leading legs.",
  "Incline Dumbbell Press": "Lie on a bench set to an incline (30-45 degrees). Hold a dumbbell in each hand at your chest. Press the weights up and slightly back, over your upper chest. Lower with control.",
  "Single-Arm Dumbbell Row": "Place one knee and the same-side hand on a bench. Hold a dumbbell in the opposite hand with your arm extended. Row the dumbbell up to your side, keeping your back flat. Lower with control and repeat for reps before switching sides.",
  "Cable Tricep Pushdowns": "Attach a straight bar or rope to a high pulley. Grasp the attachment with both hands. Keeping your elbows close to your body, press the bar down until your arms are fully extended. Slowly return to the start.",
  "Leg Raises": "Lie on your back with your legs straight. Place your hands under your lower back for support. Slowly raise your legs until they are perpendicular to the floor. Lower them back down with control, not letting them touch the floor.",
  "Dumbbell Romanian Deadlifts": "Hold a dumbbell in each hand in front of your thighs. With a slight bend in your knees and a flat back, hinge at your hips and lower the weights towards the floor. Squeeze your glutes and hamstrings to return to a standing position.",
  "Dumbbell Floor Press": "Lie on the floor with your knees bent. Hold a dumbbell in each hand with your upper arms resting on the floor. Press the dumbbells straight up. Lower them until your triceps touch the floor again.",
  "Renegade Rows": "Start in a high plank position, holding a dumbbell in each hand. Keeping your core tight and hips stable, row one dumbbell up to your chest. Lower it, and repeat on the other side.",
  "Dumbbell Front Squats": "Hold a dumbbell in each hand, resting them on the front of your shoulders. Perform a squat, keeping your torso upright and elbows high.",
  "Push-Ups (on knees)": "Perform a standard push-up but with your knees on the ground. This reduces the amount of body weight you have to lift.",
  "Resistance Band Rows": "Anchor a resistance band to a sturdy object at chest height. Hold the band with both hands and step back to create tension. Pull the band towards your chest, squeezing your shoulder blades. Return to the start.",
  "Hex Bar Deadlifts": "Stand inside a hex bar and grip the handles. Keeping your back straight and chest up, drive through your feet to stand up straight. Lower the bar with control by hinging at your hips and bending your knees.",
  "Weighted Pull-Ups": "Perform a pull-up while wearing a weighted vest or a dip belt with plates attached.",
  "Hip Thrusts": "Sit on the floor with your upper back against a bench and a barbell across your hips. Drive your hips up until your torso is parallel to the floor. Squeeze your glutes at the top and lower with control.",
  "Face Pulls": "Set a cable machine to head height with a rope attachment. Grab the rope with both hands and pull it towards your face, separating your hands as you pull. Squeeze your rear deltoids and upper back.",
  "Toes-to-Bar": "Hang from a pull-up bar. In a controlled motion, raise your legs and touch your toes to the bar. Lower your legs back down slowly.",
  "Plank with Shoulder Taps": "From a high plank position, slowly lift one hand to tap the opposite shoulder, keeping your hips as still as possible. Return the hand to the floor and repeat on the other side.",
  "Bulgarian Split Squats": "Stand a few feet in front of a bench. Place the top of one foot on the bench behind you. Hold dumbbells if desired. Lower your body until your front thigh is parallel to the floor. Push back up through your front foot.",
  "Single-Arm Dumbbell Bench Press": "Lie on a bench and perform a dumbbell press with only one arm at a time. Engage your core to keep your torso from rotating.",
  "Single-Leg RDLs": "Hold a weight in one hand. Balance on the opposite leg. Hinge at your hip, extending the non-balancing leg straight behind you as you lower the weight toward the floor. Return to the start.",
  "Side Plank": "Lie on your side with your legs straight. Prop yourself up on your forearm, keeping your elbow directly under your shoulder. Lift your hips until your body forms a straight line. Hold.",
  "Banded Clamshells": "Lie on your side with your knees bent at a 90-degree angle and a resistance band around your thighs, just above your knees. Keeping your feet together, lift your top knee against the band's resistance. Lower with control.",
  "Burpee Box Jump Overs": "Perform a burpee facing a box. At the top, instead of a vertical jump, jump onto and then over the box to the other side. Turn around and repeat.",
  "Assault Bike Sprints": "On an assault bike, pedal and push with your arms as hard as possible for the specified time.",
  "Cable Crunches": "Kneel in front of a high-pulley cable machine with a rope attachment. Holding the rope on either side of your head, crunch your torso down, bringing your elbows toward your knees. Pause, then slowly return up.",
  "Elliptical Trainer": "Use an elliptical machine, pushing and pulling with your arms and legs to create a smooth, low-impact cardiovascular workout.",
  "Plank to Push-Up": "Start in a forearm plank. Place one hand on the floor and push up, then the other, to get into a high plank. Lower back down to your forearms one arm at a time.",
  "Alternating Step-Ups": "Perform a step-up, but alternate which leg leads with each repetition.",
  "Bicycle Crunches": "Lie on your back and bring your hands behind your head. Alternate bringing your right elbow to your left knee, and your left elbow to your right knee, in a pedaling motion.",
  "Superman": "Lie face down with your arms and legs extended. Simultaneously lift your arms, chest, and legs off the floor. Hold for a moment, then lower.",
  "Reverse Lunges": "From a standing position, step backward with one foot and lower into a lunge. Push off your back foot to return to the start.",
  "Leg Extensions": "Sit in a leg extension machine. Hook your ankles under the pad. Extend your legs until they are straight, squeezing your quads. Lower with control.",
  "Seated Calf Raises": "Sit at a calf raise machine with the pads on your thighs. Press up through the balls of your feet to lift the weight. Lower your heels as far as is comfortable.",
  "Incline Cable Flys": "Lie on an incline bench positioned between two cable pulleys. Grab a handle in each hand. With a slight bend in your elbows, bring your hands together in an arc over your chest. Slowly reverse the motion.",
  "Lying Leg Curls": "Lie face down on a leg curl machine with your ankles under the pad. Curl your legs up, bringing your heels toward your glutes. Lower with control.",
  "Cable Kickbacks": "Attach an ankle strap to a low cable pulley. Facing the machine, kick the attached leg straight back, squeezing your glute at the peak of the motion. Return to the start.",
  "Lat Pulldowns (Close Grip)": "Perform a lat pulldown using a V-bar or a close, underhand grip on the bar. This variation emphasizes the lower lats and biceps more.",
  "Dumbbell Pullovers": "Lie on a bench with your head supported. Hold one dumbbell with both hands over your chest. Keeping a slight bend in your elbows, lower the weight in an arc behind your head. Pull the weight back over your chest.",
  "Back Extensions": "Use a hyperextension bench. With your feet secured, lower your torso down, then raise it back up until your body is in a straight line. Squeeze your glutes and lower back.",
  "Upright Rows": "Hold a barbell or dumbbells with an overhand grip, hands close together. Pull the weight straight up towards your chin, leading with your elbows. Lower with control.",
  "Dumbbell Bicep Curls": "Stand or sit holding a dumbbell in each hand, palms facing forward. Curl the weights up toward your shoulders, keeping your elbows at your sides. Lower with control.",
  "Hammer Curls": "Perform a bicep curl but with your palms facing each other (a neutral grip).",
  "Overhead Tricep Extensions": "Sit or stand, holding one dumbbell with both hands overhead. Lower the dumbbell behind your head by bending your elbows. Extend your arms to lift it back up.",
  "Conventional Deadlifts": "Stand with your feet hip-width apart, shins close to the barbell. Hinge at your hips and bend your knees to grip the bar just outside your legs. Keeping your back straight, lift the bar by driving through your feet and extending your hips and knees.",
  "Good Mornings": "With a barbell on your back (like a squat), keep your legs almost straight and hinge at your hips. Lower your torso until it's nearly parallel to the floor, keeping your back flat. Return to the start by squeezing your hamstrings and glutes.",
  "T-Bar Rows": "Position yourself on a T-bar row machine. Pull the handles toward your chest, squeezing your back muscles. Lower the weight with control.",
  "StairMaster": "Use a stair-climbing machine, maintaining an upright posture and a consistent pace.",
  "Single-Leg Press": "Perform a leg press using only one leg at a time. This helps address muscle imbalances.",
  "Chest-Supported Rows": "Lie face down on an incline bench, holding a dumbbell in each hand. Row the weights up, squeezing your shoulder blades together. This isolates the back by preventing you from using momentum.",
  "Dips (Assisted or Bodyweight)": "Use parallel bars. Lower your body by bending your elbows until your shoulders are below your elbows. Press back up to the start. Use an assisted machine or a band to make it easier.",
  "Inverted Rows": "Set a barbell in a squat rack at about waist height. Lie underneath it and grab it with an overhand grip. Keeping your body straight, pull your chest up to the bar. Lower with control.",
  "Lat Pulldowns (Underhand Grip)": "Perform a lat pulldown with an underhand, shoulder-width grip. This increases bicep involvement.",
  "Jump Rope": "Use a jump rope, jumping with both feet, alternating feet, or performing double-unders.",
  "Sumo Deadlifts": "Perform a deadlift with a very wide stance and your hands gripping the bar inside your legs. This variation targets the glutes and inner thighs more.",
  "Abductor Machine": "Sit in a hip abduction machine with the pads on the outside of your knees. Push your legs apart against the resistance.",
  "Barbell Front Squats": "Hold a barbell across the front of your shoulders using a 'clean' grip or by crossing your arms. Perform a squat, focusing on keeping your torso upright.",
  "Banded Fire Hydrants": "Start on all fours with a resistance band around your thighs. Keeping your knee bent, lift one leg out to the side, like a dog at a fire hydrant. Lower with control.",
  "Frog Pumps": "Lie on your back with the soles of your feet together and knees out to the sides. Place your hands on your hips. Squeeze your glutes to lift your hips up and down.",
  "Side-Lying Leg Raises": "Lie on your side with your legs stacked and straight. Lift your top leg up as high as you can without rocking your torso. Lower with control.",
  "Close-Grip Bench Press": "Perform a barbell bench press with your hands closer together (about shoulder-width). This places more emphasis on the triceps.",
  "Dips": "Using parallel bars, lower your body until your shoulders are below your elbows, then press back up. Keep your torso upright to target triceps, or lean forward to target the chest.",
  "Skull Crushers": "Lie on a bench holding an EZ-bar or dumbbells above your chest. Bending only at the elbows, lower the weight towards your forehead. Extend your arms to return to the start.",
  "Tricep Rope Pushdowns": "Perform a tricep pushdown using a rope attachment. At the bottom of the movement, pull the rope handles apart to better isolate the triceps.",
  "Glute-Ham Raises": "Use a glute-ham developer (GHD) machine. Lower your torso towards the floor, then raise it back up by powerfully contracting your hamstrings and glutes.",
  "Cable Pull Throughs": "Stand facing away from a low cable pulley with a rope attachment. Reach between your legs to grab the rope. Walk forward to create tension. Hinge at your hips, then drive them forward, squeezing your glutes.",
  "Barbell Shrugs": "Hold a heavy barbell or dumbbells at your sides. Elevate your shoulders straight up towards your ears. Hold the squeeze at the top, then lower.",
  "Cable Face Pulls": "Perform a face pull using a cable machine.",
  "Goblet Squats (Superset with Jump Rope)": "Perform a set of Goblet Squats, then immediately perform a set of Jump Rope without rest.",
  "Alternating Lunges (Superset with High Knees)": "Perform a set of Alternating Lunges, then immediately perform a set of High Knees without rest.",
  "Glute Bridges (Superset with Mountain Climbers)": "Perform a set of Glute Bridges, then immediately perform a set of Mountain Climbers without rest.",
  "Dumbbell Floor Press (light)": "Perform a dumbbell floor press using lighter weights for a higher rep range.",
  "Wall Push-Ups": "Perform a push-up against a wall. The closer you stand to the wall, the easier it is.",
  "Barbell Curls 21s": "Perform 7 bicep curls from the bottom to the halfway point, then 7 curls from the halfway point to the top, and finally 7 full-range-of-motion curls, all back-to-back.",
  "Preacher Curls": "Use a preacher bench to isolate your biceps. Rest your upper arm on the pad and curl a dumbbell or barbell.",
  "Concentration Curls": "Sit on a bench and lean forward, resting your elbow against your inner thigh. Curl a dumbbell up, focusing on squeezing the bicep.",
  "Hollow Body Hold": "Lie on your back and lift your shoulders and legs off the floor, keeping your lower back pressed down. Your body should form a shallow 'banana' shape. Hold.",
  "Overhead Dumbbell Tricep Extension": "Perform an overhead tricep extension with a single dumbbell held in both hands.",
  "Ab Rollouts": "Kneel on the floor holding an ab wheel or a loaded barbell. Slowly roll forward, keeping your arms straight and core tight. Use your abs to pull yourself back to the start.",
  "Ski Erg": "Use a ski erg machine, mimicking the motion of cross-country skiing by pulling the handles down in a powerful, fluid motion.",
  "Light Dumbbell Lateral Raises": "Perform dumbbell lateral raises using lighter weights for a higher rep range, focusing on form and the muscle contraction.",
  "Banded Face Pulls": "Perform a face pull using a resistance band anchored to a sturdy object.",
  "Heavy Dumbbell Lateral Raises": "Perform dumbbell lateral raises using heavier weights for a lower rep range, focusing on strength.",
  "Tricep Dips (on bench)": "Sit on the edge of a bench and place your hands on the edge next to your hips. Slide your hips forward off the bench and lower your body by bending your elbows. Press back up.",
  "Pendlay Rows": "Perform a barbell row where the bar starts on the floor for every rep. Pull the bar explosively to your chest, then return it to the floor.",
  "Heavy Dumbbell Curls": "Perform bicep curls using heavy dumbbells for a lower rep range.",
  "Single-Arm Lat Pulldowns": "Perform a lat pulldown using one arm at a time. This helps with mind-muscle connection and correcting imbalances.",
  "Pallof Press": "Stand sideways to a cable machine with the handle at chest height. Hold the handle with both hands at the center of your chest. Press your hands straight out in front of you, resisting the rotational pull from the cable. Bring your hands back and repeat.",
  "Kettlebell Halos": "Hold a kettlebell by the horns, upside down. Circle it around your head, keeping it close to your body. Alternate directions.",
  "Cable Crossovers": "Stand between two high cable pulleys. Grab the handles and bring them down and across your body in a hugging motion, squeezing your chest muscles."
}
